IDEA StatiCa Open Model
ConnectionData Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ConnectionData type exposes the following members.
Properties
Name | Description
AnchorGrids
 Anchor grids which belongs to the connection
Beams
 Connected beams
BoltGrids
 Bolt grids which belongs to the connection
ConcreteBlocks
 ConcreteBlocksof the connection
CutBeamByBeams
 cut beam by beams
FoldedPlates
 Folded plate of the connection
Plates
 Plates of the connection
Welds
 Welds of the connection
Top
See Also
Reference
ConnectionData Class
IdeaRS.OpenModel.Connection Namespace